# 함수 매핑

- 시리즈 또는 데이터프레임의 개별 원소를 특정 함수에 일대일 대응시키는 과정
- 사용자가 직접 만든 함수를 적용할 수 있기 때문에 파아스 기본 함수로 처리하기 어려운 복잡한 연산을 적용하는 것이 가능

## 개별 원소에 함수 매핑

### 시리즈 원소에 함수 매핑
- 시리즈에 map() 을 적용하면 이자로 전달받는 매핑 함수에 시리즈이 모든 원소를 하나씩 입력하고 리턴값을 받음
- 시리즈 원소의 개수만큼 리턴값을 받아서 같은 크기의 시리즈 객체로 변환

In [1]:
import pandas as pd
import seaborn as sns

In [2]:
titanic = sns.load_dataset("titanic")

In [3]:
df = titanic.loc[:, ["age","fare"]]

In [4]:
df.head()

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500

In [5]:
def add_10(n): # 10을 더하는 함수
    return n + 10

In [6]:
df["age"].map(add_10)

0      32.0
1      48.0
2      36.0
3      45.0
4      45.0
       ...
886    37.0
887    29.0
888     NaN
889    36.0
890    42.0
Name: age, Length: 891, dtype: float64

In [7]:
# 한번사용하고 말 함수를 선언하는것은 매우 비효율적
# 그래서 익명함수를 쓴다

In [8]:
# lambda expression 람다 표현식

In [10]:
df["age"].map(lambda x : x + 10)

0      32.0
1      48.0
2      36.0
3      45.0
4      45.0
       ...
886    37.0
887    29.0
888     NaN
889    36.0
890    42.0
Name: age, Length: 891, dtype: float64

In [11]:
# 학계분을 싫어한다 => 구현해본적없음!

In [12]:
# 온몸 비틀기는 덕목이다!
# 파이썬 기초를 알면 다 할 수 있다!
# 파이썬의 기초를 탄탄하게!

### 데이터프레임 원소에 함수 매핑

In [13]:
df.head()

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500

In [14]:
df.map(lambda x : x + 10)

      age     fare
0    32.0  17.2500
1    48.0  81.2833
2    36.0  17.9250
3    45.0  63.1000
4    45.0  18.0500
..    ...      ...
886  37.0  23.0000
887  29.0  40.0000
888   NaN  33.4500
889  36.0  40.0000
890  42.0  17.7500

[891 rows x 2 columns]

In [ ]:
# 하나하나의 원소에 mapping 하는 것은 쉽다!
# 객체에 매핑하려면???

## 데이터프레임 객체에 함수 매핑

In [16]:
df.apply(lambda x: x["age"] + x["fare"], axis=1)

0       29.2500
1      109.2833
2       33.9250
3       88.1000
4       43.0500
         ...
886     40.0000
887     49.0000
888         NaN
889     56.0000
890     39.7500
Length: 891, dtype: float64